package task22;

/**
 * 1 Создай ветку task22
 * 2 Реализуй следующий сценарий:
 *      a. Предусловие: пользователь авторизован
 *      b. Открыть страницу “Графики работы” через боковое меню
 *      c. Для текущего рабочего дня в боковом снипете нажать кнопку “Изменить”
 *      d. Во всплывающем окне “Изменение графика работы” заполнить:
 *          I. С кем согласовано: случайный пользователь из списка (именно случайны, а не первый/ последний или
 *          фиксированный)
 *          II. Файлы для согласования: загрузить 1 файл (картинку можешь выбрать сам)
 *      e. Нажать кнопку “Сохранить”
 *      f. Проверить что появилось сообщение “Расписание успешно изменено”
 *      g. Не меняя текущего рабочего дня, в боковом снипете нажать кнопку “Изменить”
 *      h. Во всплывающем окне “Изменение графика работы” проверить:
 *          I. С кем согласовано: совпадает с введенным на шаге 4
 *      a. Файлы для согласование:
 *          I. содержит картинку. Картинка имеет ненулевой отображаемый размер
 *          II. при наведении на картинку выводится название файла, добавленного на шаге 4 (достаточно проверить наличие
 *          текста, наводить курсор и проверять отображение можно, но не обязательно)
 *
 * @author Алексеев Степан
 * @date 23.01.2023
 */
public class Main {
}
